Revit 2026 API
Zone.RemoveSpaces Method
Note: This API is now obsolete.
Remove a set of existing spaces to the current Zone element.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")]
public bool RemoveSpaces(
	SpaceSet spaces
)
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")>
Public Function RemoveSpaces (
	spaces As SpaceSet
) As Boolean
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")]
bool RemoveSpaces(
	SpaceSet^ spaces
)
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone object instead.")>]
member RemoveSpaces :
        spaces : SpaceSet -> bool
Parameters
spaces SpaceSet
 The spaces which want to delete from the current zone element.
Return Value
Boolean
 If successful the current zone element will remove a set of input spaces, otherwise null.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the specified parameter Value is null.
InvalidOperationException |  Thrown when the input spaces cannot be deleted from current zone element.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace